In [1]:
%matplotlib inline

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [3]:
#stored data file path
mortality_data_path = "/Users/matthewvicario/Desktop/Project3/exp_mortality.csv"
exports_data_path = "/Users/matthewvicario/Desktop/Project3/all_exports.csv"

In [4]:
mortality_data = pd.read_csv(mortality_data_path)
mortality_data.head()

  Export Date  Species  Consignment Mortality Level Destination Mode
0      Aug-19  Buffalo                            6     Vietnam  Sea
1      Jul-19   Cattle                           22     Vietnam  Sea
2      May-19   Cattle                           53     Vietnam  Sea
3      May-19   Cattle                           25       China  Sea
4      Mar-19   Cattle                           53     Vietnam  Sea

In [5]:
mortality_count = pd.DataFrame(mortality_data.groupby(["Export Date","Species"],as_index = False)["Consignment Mortality Level"].sum())
mortality_count.head()

  Export Date Species  Consignment Mortality Level
0      Apr-16  Cattle                          155
1      Apr-17  Cattle                           95
2      Aug-15   Goats                           48
3      Aug-15   Sheep                          125
4      Aug-16   Sheep                          748

In [6]:
exports_data = pd.read_csv(exports_data_path)
exports_data.head()

  Mode Month State      Load Port Species    End Use   Country  Quantity  Year
0  Air   Jul    SA       Adelaide   Goats  Slaughter  Malaysia       100  2014
1  Sea   Jul    SA  Port Adelaide   Sheep  Slaughter   Bahrain     22000  2014
2  Sea   Jul    SA  Port Adelaide   Sheep  Slaughter     Qatar     25484  2014
3  Air   Jul    SA       Adelaide   Sheep  Slaughter  Malaysia       111  2014
4  Sea   Jul    WA      Fremantle  Cattle  Slaughter     Egypt      2403  2014

In [7]:
neworder = exports_data[["Month", "Year", "Species", "Quantity", "Mode","Country", "End Use"]]
neworder.rename(columns = {"Country":"Destination"}, inplace = True)
neworder = neworder.replace("August","Aug")
neworder = neworder.replace("July","Jul")
neworder = neworder.replace("Sept","Sep")
neworder.head()

/Users/matthewvicario/opt/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

  Month  Year Species  Quantity Mode Destination    End Use
0   Jul  2014   Goats       100  Air    Malaysia  Slaughter
1   Jul  2014   Sheep     22000  Sea     Bahrain  Slaughter
2   Jul  2014   Sheep     25484  Sea       Qatar  Slaughter
3   Jul  2014   Sheep       111  Air    Malaysia  Slaughter
4   Jul  2014  Cattle      2403  Sea       Egypt  Slaughter

In [8]:
start, stop = 2, 4
neworder["Year"] = neworder["Year"].astype(str)
neworder["Year"] = neworder["Year"].str.slice(start, stop)
neworder.head()

  Month Year Species  Quantity Mode Destination    End Use
0   Jul   14   Goats       100  Air    Malaysia  Slaughter
1   Jul   14   Sheep     22000  Sea     Bahrain  Slaughter
2   Jul   14   Sheep     25484  Sea       Qatar  Slaughter
3   Jul   14   Sheep       111  Air    Malaysia  Slaughter
4   Jul   14  Cattle      2403  Sea       Egypt  Slaughter

In [9]:
neworder["Export Date"] = pd.DataFrame(neworder["Month"].map(str) + "-" + neworder["Year"].map(str))
neworder.head()

  Month Year Species  Quantity Mode Destination    End Use Export Date
0   Jul   14   Goats       100  Air    Malaysia  Slaughter      Jul-14
1   Jul   14   Sheep     22000  Sea     Bahrain  Slaughter      Jul-14
2   Jul   14   Sheep     25484  Sea       Qatar  Slaughter      Jul-14
3   Jul   14   Sheep       111  Air    Malaysia  Slaughter      Jul-14
4   Jul   14  Cattle      2403  Sea       Egypt  Slaughter      Jul-14

In [10]:
clean_exports = neworder[["Export Date", "Species", "Quantity", "Mode","Destination", "End Use"]]
clean_exports.head()

  Export Date Species  Quantity Mode Destination    End Use
0      Jul-14   Goats       100  Air    Malaysia  Slaughter
1      Jul-14   Sheep     22000  Sea     Bahrain  Slaughter
2      Jul-14   Sheep     25484  Sea       Qatar  Slaughter
3      Jul-14   Sheep       111  Air    Malaysia  Slaughter
4      Jul-14  Cattle      2403  Sea       Egypt  Slaughter

In [11]:
export_count = pd.DataFrame(clean_exports.groupby(["Export Date","Species"],as_index = False)["Quantity"].sum())
export_count

    Export Date  Species  Quantity
0        Apr-15  Buffalo       417
1        Apr-15   Cattle    168594
2        Apr-15     Deer        90
3        Apr-15    Goats      6832
4        Apr-15    Sheep    183948
..          ...      ...       ...
307      Sep-19  Alpacas         4
308      Sep-19  Buffalo       655
309      Sep-19   Cattle    107775
310      Sep-19    Goats      1982
311      Sep-19    Sheep     59354

[312 rows x 3 columns]

In [12]:
combined_count = pd.merge(mortality_count, export_count, how ='outer', left_on =["Export Date","Species"], right_on = ["Export Date", "Species"])
combined_count["Export Date"].unique()

array(['Apr-16', 'Apr-17', 'Aug-15', 'Aug-16', 'Aug-17', 'Aug-18',
       'Aug-19', 'Dec-17', 'Dec-18', 'Feb-14', 'Feb-15', 'Jan-14',
       'Jan-15', 'Jan-18', 'Jul-16', 'Jul-18', 'Jul-19', 'Mar-16',
       'Mar-19', 'May-16', 'May-18', 'May-19', 'Nov-16', 'Oct-14',
       'Oct-18', 'Sep-17', 'Apr-15', 'Apr-18', 'Apr-19', 'Aug-14',
       'Dec-14', 'Dec-15', 'Dec-16', 'Dec-19', 'Feb-16', 'Feb-17',
       'Feb-18', 'Feb-19', 'Jan-16', 'Jan-17', 'Jan-19', 'Jul-14',
       'Jul-15', 'Jul-17', 'Jun-15', 'Jun-16', 'Jun-17', 'Jun-18',
       'Jun-19', 'Mar-15', 'Mar-17', 'Mar-18', 'May-15', 'May-17',
       'Nov-14', 'Nov-15', 'Nov-17', 'Nov-18', 'Nov-19', 'Oct-15',
       'Oct-16', 'Oct-17', 'Oct-19', 'Sep-14', 'Sep-15', 'Sep-16',
       'Sep-18', 'Sep-19'], dtype=object)

In [13]:
from datetime import datetime

In [26]:
combined_count["Export Date"] = pd.to_datetime(combined_count["Export Date"],format ='%b-%y')
combined_count.head()

  Export Date Species  Consignment Mortality Level  Quantity
0  2016-04-01  Cattle                        155.0  107892.0
1  2017-04-01  Cattle                         95.0   63013.0
2  2015-08-01   Goats                         48.0   12014.0
3  2015-08-01   Sheep                        125.0  159675.0
4  2016-08-01   Sheep                        748.0  236033.0

In [29]:
combined_count = combined_count.sort_values(by=["Export Date"])
combined_count

    Export Date  Species  Consignment Mortality Level  Quantity
12   2014-01-01   Cattle                        214.0       NaN
10   2014-02-01   Cattle                         49.0       NaN
146  2014-07-01    Sheep                          NaN  276782.0
145  2014-07-01    Goats                          NaN    5448.0
144  2014-07-01   Cattle                          NaN   94012.0
..          ...      ...                          ...       ...
97   2019-12-01  Alpacas                          NaN      24.0
98   2019-12-01  Buffalo                          NaN     463.0
99   2019-12-01   Cattle                          NaN  118149.0
100  2019-12-01    Goats                          NaN     874.0
101  2019-12-01    Sheep                          NaN  173869.0

[314 rows x 4 columns]